export const SubMessages = {
    en: {
        search_placeholder: "Поиск по имени",
        table: {
            titles: [
                "Имя субаккаунта",
                "Воркеры",
                "Текущий хешрейт",
                "Хешрейт / 24ч",
                "Выплачено всего",
            ]
        }
    },
    ru: {
        search_placeholder: "Поиск по имени",
        table: {
            titles: [
                "Имя субаккаунта",
                "Воркеры",
                "Текущий хешрейт",
                "Хешрейт / 24ч",
                "Выплачено всего",
            ]
        }
    }
}
